In [1]:
import pandas as pd

In [2]:
bank_client_df=pd.DataFrame({"Bank client ID":[111,222,333,444],
                            "Bank client name":["chanel","Steve","Mitch","Ryan"],
                            "Net Worth [$]":[3500,29000,10000,2000],
                            "Years with Bank":[3,4,9,5]})

In [3]:
bank_client_df

   Bank client ID Bank client name  Net Worth [$]  Years with Bank
0             111           chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [4]:
df_loyal=bank_client_df[bank_client_df["Years with Bank"]>=5]

In [5]:
df_loyal

   Bank client ID Bank client name  Net Worth [$]  Years with Bank
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [6]:
del bank_client_df["Bank client ID"]

In [7]:
bank_client_df

  Bank client name  Net Worth [$]  Years with Bank
0           chanel           3500                3
1            Steve          29000                4
2            Mitch          10000                9
3             Ryan           2000                5

In [12]:
df_high_worth=bank_client_df[(bank_client_df["Net Worth [$]"]>=5000)]

In [13]:
df_high_worth

  Bank client name  Net Worth [$]  Years with Bank
1            Steve          29000                4
2            Mitch          10000                9

In [14]:
df_high_worth.sum()

Bank client name    SteveMitch
Net Worth [$]            39000
Years with Bank             13
dtype: object

In [15]:
bank_client_df=pd.DataFrame({"Bank client ID":[111,222,333,444],
                            "Bank client name":["chanel","Steve","Mitch","Ryan"],
                            "Net Worth [$]":[3500,29000,10000,2000],
                            "Years with Bank":[3,4,9,5]})

In [16]:
bank_client_df

   Bank client ID Bank client name  Net Worth [$]  Years with Bank
0             111           chanel           3500                3
1             222            Steve          29000                4
2             333            Mitch          10000                9
3             444             Ryan           2000                5

In [17]:
def networth_updated(balance):
    return balance*1.1

In [19]:
bank_client_df["Net Worth [$]"].apply(networth_updated)

0     3850.0
1    31900.0
2    11000.0
3     2200.0
Name: Net Worth [$], dtype: float64

In [25]:
def networth_updated_1(balance):
    return balance+100

In [26]:
r=bank_client_df["Net Worth [$]"].apply(networth_updated_1)

In [24]:
r.sum()

89400

In [28]:
r

0     3600
1    29100
2    10100
3     2100
Name: Net Worth [$], dtype: int64